import { Title } from "../../shared/components/Title";

const Privacy = () => {
  return (
    <div className="flex justify-center p-5 sm:p-10">
      <div className="w-full max-w-4xl space-y-8">
        <Title title="Privacy Policy" subtitle="プライバシーポリシー" />

        {/* 内容 */}
        <div className="space-y-2 text-sm leading-normal">
          <p>
            Cafe Your
            Tea（以下、「本サービス」といいます。）は、本ウェブサイト上で提供する本サービスにおける、ユーザーの個人情報の取扱いについて、以下のとおりプライバシーポリシー（以下、「本ポリシー」といいます。）を定めます。
          </p>

          <h2>第1条（個人情報）</h2>
          <p>
            「個人情報」とは、個人情報保護法にいう「個人情報」を指すものとし、生存する個人に関する情報であって、
            当該情報に含まれるユーザー名、メールアドレス、IPアドレス、その他の記述等により特定の個人を識別できる情報を指します。
          </p>

          <h2>第2条（個人情報の収集方法）</h2>
          <p>
            本サービスは、ユーザーが利用登録をする際にユーザー名、メールアドレスを取得します。
            また、本サービス利用時のユーザーのログ情報等を外部サービスなどから収集することがあります。
          </p>

          <h2>第3条（個人情報を収集・利用する目的）</h2>
          <p>本サービスが個人情報を収集・利用する目的は、以下のとおりです。</p>
          <ul className="list-disc space-y-1 pl-4">
            <li>本サービスの提供・運営のため</li>
            <li>
              ユーザーからのお問い合わせに回答するため（本人確認を行うことを含む）
            </li>
            <li>ユーザーが利用中のサービスの新機能、更新情報のご連絡のため</li>
            <li>メンテナンス、重要なお知らせなど必要に応じたご連絡のため</li>
            <li>
              利用規約に違反したユーザーや、不正・不当な目的でサービスを利用しようとするユーザーの特定をし、ご利用をお断りするため
            </li>
            <li>
              ユーザーにご自身の登録情報の閲覧や変更、削除、ご利用状況の閲覧を行っていただくため
            </li>
            <li>上記の利用目的に付随する目的</li>
          </ul>

          <h2>第4条（利用目的の変更）</h2>
          <p>
            本サービスは、利用目的が変更前と関連性を有すると合理的に認められる場合に限り、個人情報の利用目的を変更するものとします。
          </p>
          <p>
            利用目的の変更を行った場合には、変更後の目的について、本サービス所定の方法により、
            ユーザーに通知し、または本ウェブサイト上に公表するものとします。
          </p>

          <h2>第5条（個人情報の第三者提供）</h2>
          <p>
            本サービスは、次に掲げる場合を除いて、あらかじめユーザーの同意を得ることなく、第三者に個人情報を提供することはありません。
            ただし、個人情報保護法その他の法令で認められる場合を除きます。
          </p>

          <h2>第6条（個人情報の開示）</h2>
          <p>
            本サービスは、本人から個人情報の開示を求められたときは、本人に対し、遅滞なくこれを開示します。
            ただし、開示することにより次のいずれかに該当する場合は、その全部または一部を開示しないこともあり、
            開示しない決定をした場合には、その旨を遅滞なく通知します。
          </p>
          <ul className="list-disc space-y-1 pl-4">
            <li>
              本人または第三者の生命、身体、財産その他の権利利益を害するおそれがある場合
            </li>
            <li>本サービスの運営に著しい支障を及ぼすおそれがある場合</li>
            <li>その他法令に違反することとなる場合</li>
          </ul>
          <p>
            前項の定めにかかわらず、履歴情報および特性情報などの個人情報以外の情報については、原則として開示いたしません。
          </p>

          <h2>第7条（個人情報の訂正および削除）</h2>
          <p>
            ユーザーは、本サービスの保有する自己の個人情報が誤った情報である場合には、本サービスが定める手続きにより、
            個人情報の訂正、追加または削除（以下、「訂正等」といいます。）を請求することができます。
          </p>
          <p>
            本サービスは、ユーザーから前項の請求を受けてその請求に応じる必要があると判断した場合には、遅滞なく、当該個人情報の訂正等を行うものとします。
          </p>
          <p>
            本サービスは、前項の規定に基づき訂正等を行った場合、または訂正等を行わない旨の決定をしたときは遅滞なく、これをユーザーに通知します。
          </p>

          <h2>第8条（個人情報の利用停止等）</h2>
          <p>
            本サービスは、本人から、個人情報が、利用目的の範囲を超えて取り扱われているという理由、
            または不正の手段により取得されたものであるという理由により、その利用の停止または消去（以下、「利用停止等」といいます。）を求められた場合には、
            遅滞なく必要な調査を行います。
          </p>
          <p>
            前項の調査結果に基づき、その請求に応じる必要があると判断した場合には、遅滞なく、当該個人情報の利用停止等を行います。
          </p>
          <p>
            本サービスは、前項の規定に基づき利用停止等を行った場合、または利用停止等を行わない旨の決定をしたときは、
            遅滞なく、これをユーザーに通知します。
          </p>
          <p>
            前2項にかかわらず、利用停止等に多額の費用を有する場合その他利用停止等を行うことが困難な場合であって、
            ユーザーの権利利益を保護するために必要なこれに代わるべき措置をとれる場合は、この代替策を講じるものとします。
          </p>

          <h2>第9条（プライバシーポリシーの変更）</h2>
          <p>
            本ポリシーの内容は、法令その他本ポリシーに別段の定めのある事項を除いて、
            ユーザーに通知することなく、変更することができるものとします。
          </p>
          <p>
            本サービスが別途定める場合を除いて、変更後のプライバシーポリシーは、本ウェブサイトに掲載したときから効力を生じるものとします。
          </p>
        </div>
      </div>
    </div>
  );
};

export default Privacy;
