import { Title } from "../../shared/components/Title";

const About = () => {
  return (
    <div className="flex justify-center p-5 sm:p-10">
      <div className="w-full max-w-4xl space-y-8">
        <Title title="About" subtitle="このカフェについて" />

        {/* 内容 */}
        <p>
          アプリの世界観や遊び方などの説明文章を掲載。アプリの世界観や遊び方などの説明文章を掲載。アプリの世界観や遊び方などの説明文章を掲載。アプリの世界観や遊び方などの説明文章を掲載。アプリの世界観や遊び方などの説明文章を掲載。アプリの世界観や遊び方などの説明文章を掲載。アプリの世界観や遊び方などの説明文章を掲載。アプリの世界観や遊び方などの説明文章を掲載。
        </p>

        <p>
          利用規約・プライバシーポリシー・お問い合わせへの案内もこのページで行う。利用規約・プライバシーポリシー・お問い合わせへの案内もこのページで行う。利用規約・プライバシーポリシー・お問い合わせへの案内もこのページで行う。利用規約・プライバシーポリシー・お問い合わせへの案内もこのページで行う。
        </p>
      </div>
    </div>
  );
};

export default About;
